// Напишите программу, которая задаёт массив из N элементов и выводит их на экран.
// 1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]

Console.WriteLine("Введите элементы массива (без запятых): ");
int number = int.Parse(Console.ReadLine()!);

string number2 = number.ToString();




